In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame,Series
from numpy.random import randn

In [3]:
ser = Series(randn(6),index = [[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [4]:
ser

1  a   -0.101276
   b   -0.195854
   c   -0.224881
2  a    1.586945
   b   -1.214462
   c    0.536607
dtype: float64

In [6]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [7]:
ser[1]

a   -0.101276
b   -0.195854
c   -0.224881
dtype: float64

In [8]:
ser[2]

a    1.586945
b   -1.214462
c    0.536607
dtype: float64

In [9]:
 ser[:,'b'] # to call all values of b from 1 and 2

1   -0.195854
2   -1.214462
dtype: float64

In [10]:
ser

1  a   -0.101276
   b   -0.195854
   c   -0.224881
2  a    1.586945
   b   -1.214462
   c    0.536607
dtype: float64

In [11]:
#To make the dataframe of multiple level index

dframe =ser.unstack()

In [12]:
dframe

          a         b         c
1 -0.101276 -0.195854 -0.224881
2  1.586945 -1.214462  0.536607

In [18]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index = [['a','a','b','b'],[1,2,1,2]], 
                   columns = [['Pune','Pune','Delhi','Delhi'],['Cold','Hot','Cold','Hot']])

In [19]:
dframe2

    Pune     Delhi
    Cold Hot  Cold Hot
a 1    0   1     2   3
  2    4   5     6   7
b 1    8   9    10  11
  2   12  13    14  15

In [20]:
dframe2.index.names = ['Index 1', 'Index 2']

dframe2.columns.names = ['City','Temperature']

In [21]:
dframe2

City            Pune     Delhi
Temperature     Cold Hot  Cold Hot
Index 1 Index 2
a       1          0   1     2   3
        2          4   5     6   7
b       1          8   9    10  11
        2         12  13    14  15

In [22]:
dframe2.swaplevel('City','Temperature',axis = 1)

Temperature     Cold  Hot  Cold   Hot
City            Pune Pune Delhi Delhi
Index 1 Index 2
a       1          0    1     2     3
        2          4    5     6     7
b       1          8    9    10    11
        2         12   13    14    15

In [24]:
dframe2.sortlevel()

AttributeError: 'DataFrame' object has no attribute 'sortlevel'

In [25]:
dframe2.sum(level = 'Temperature',axis = 1)

Temperature      Cold  Hot
Index 1 Index 2
a       1           2    4
        2          10   12
b       1          18   20
        2          26   28

In [26]:
dframe2

City            Pune     Delhi
Temperature     Cold Hot  Cold Hot
Index 1 Index 2
a       1          0   1     2   3
        2          4   5     6   7
b       1          8   9    10  11
        2         12  13    14  15